Internal_Wave_Tank_2024/wave_tank_2D_3phases_k_omega_fine/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
A 0.035; // amplitude
f 0.5; // frequency

w #eval{ $f*3.141593 };

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolver    solidBody;

solidBodyMotionFunction oscillatingLinearMotion;

oscillatingLinearMotionCoeffs
{
amplitude ($A 0 0);
omega $w;
}


// ************************************************************************* //
