Internal_Wave_Tank_2024/wave_tank_2D_3phases_k_omega_fine/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
     water
     {
         transportModel Newtonian;
         nu             1e-06;
         rho            1000;
     }

     oil
     {
         transportModel Newtonian;
         nu             1e-05;
         rho            800;
     }
     air
     {
         transportModel Newtonian;
         nu             1.48e-05;
         rho            1;
     }
);

sigmas
(
    (air water) 0.07
    (air oil) 0.028
    (water oil) 0.035
);


// ************************************************************************* //
